<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python44_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [3]:
# seaborn 패키지의 샘플 중에서 titanic 데이터 프레임을 로드.
titanic = sns.load_dataset('titanic')
print(type(titanic))
print(titanic.shape)

<class 'pandas.core.frame.DataFrame'>
(891, 15)

In [4]:
# 첫 5개 행(row) 출력
titanic.iloc[:5]
# titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [7]:
titanic['survived']  # df['column_name'], df.column_name

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [8]:
type(titanic['survived'])

pandas.core.series.Series

In [9]:
# 마지막 5개 행 출력
titanic.iloc[-5:]
# titanic.tail()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[5 rows x 15 columns]

titanic 데이터 프레임 변수들(컬럼들)
*   survived: 생존 여부(0: 사망, 1: 생존)
*   pclass: 객실 등급
*   sex: 성별
*   age: 나이
*   sibsp: 동승한 형제자매, 배우자 숫자
*   parch: 동승한 부모, 자식 숫자
*   fare: 티켓 가격(운임)
*   embarked: 정박 항구

In [10]:
# 생존자, 사망자 숫자
survived = titanic['survived']
survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [18]:
result = survived.value_counts()  #> pandas.Series 타입을 리턴.
print(result)
print('사망자 숫자:', result.loc[0])
print('생존자 숫자:', result.loc[1])

0    549
1    342
Name: survived, dtype: int64
사망자 숫자: 549
생존자 숫자: 342

In [21]:
# 데이터 프레임에서 컬럼 선택: df['column_name'], df.column_name
# 데이터 프레임에서 row 선택: df[row 선택 조건식]
alive = titanic[titanic['survived'] == 1]
print('생존자 숫자:', len(alive))

dead = titanic[titanic['survived'] == 0]
print('사망자 숫자:', len(dead))

생존자 숫자: 342
사망자 숫자: 549

In [11]:
# 남성 생존자, 여성 생존자 숫자, 비율
#   생존자들 중에서 남성/여성 숫자
#   생존자들 중에서 남성/여성 비율

In [26]:
# 생존자들로 이루어진 부분집합
alive = titanic[titanic['survived'] == 1]
# 생존자 부분집합에서 성별(sex) 컬럼의 (범주들의) 빈도수
s = alive['sex'].value_counts()
s

female    233
male      109
Name: sex, dtype: int64

In [33]:
num_of_alive = len(alive)
num_of_female_alive = s.loc['female']  # s.iloc[0]
num_of_male_alive = s.loc['male']  # s.iloc[1]
print('여성 생존 비율:', num_of_female_alive / num_of_alive)
print('남성 생존 비율:', num_of_male_alive / num_of_alive)

여성 생존 비율: 0.6812865497076024
남성 생존 비율: 0.31871345029239767

In [37]:
# 남성 승객 중 생존자 비율 = 남성 생존자 / 남성 승객수
# 여성 승객 중 생존자 비율 = 여성 생존자 / 여성 승객수

# 남/녀 승객 숫자
s = titanic['sex'].value_counts()
print(s)

num_of_male = s.loc['male']
num_of_female = s.loc['female']

print('여성 생존 비율:', num_of_female_alive / num_of_female)
print('남성 생존 비율:', num_of_male_alive / num_of_male)

male      577
female    314
Name: sex, dtype: int64
여성 생존 비율: 0.7420382165605095
남성 생존 비율: 0.18890814558058924

In [40]:
# 남성 승객 숫자: 남성 승객들 부분집합의 row 개수
num_of_male = len(titanic[titanic['sex'] == 'male'])

# 남성 생존자 숫자: 남성 생존자들 부분집합의 row 개수
num_of_male_alive = len(titanic[(titanic['sex'] == 'male') & 
                                (titanic['survived'] == 1)])

print('남성 생존 비율:', num_of_male_alive / num_of_male)

남성 생존 비율: 0.18890814558058924

In [49]:
# 객실 등급(pclass)별 생존자 숫자, 비율
#   생존자들 중에서 각 객실 등급별 승객 숫자
#   생존자들 중에서 각 객실 등급별 승객 비율

# 1) 생존자 부분집합
subset = titanic[titanic['survived'] == 1]
# subset

# 2) 생존자 부분집합에서 객실 등급 value_counts()
s = subset['pclass'].value_counts()
print(s)

print('1등급 객실 생존자 숫자:', s.loc[1])  # s.iloc[0]
print('2등급 객실 생존자 숫자:', s.loc[2])  # s.iloc[2]
print('3등급 객실 생존자 숫자:', s.loc[3])  # s.iloc[1]

# 3) 생존자 부부집합에서 각 객실 등급의 비율
print('pclass 1:', s.loc[1] / len(subset))
print('pclass 2:', s.loc[2] / len(subset))
print('pclass 3:', s.loc[3] / len(subset))

1    136
3    119
2     87
Name: pclass, dtype: int64
1등급 객실 생존자 숫자: 136
2등급 객실 생존자 숫자: 87
3등급 객실 생존자 숫자: 119
pclass 1: 0.39766081871345027
pclass 2: 0.2543859649122807
pclass 3: 0.347953216374269

In [50]:
# 1등급 객실의 생존자 숫자
len(titanic[(titanic['survived'] == 1) & (titanic['pclass'] == 1)])

136

In [57]:
# 1등급 객실 승객 중 생존자 비율
num_of_pclass1 = len(titanic[titanic['pclass'] == 1])  # 1등급 객실 승객 수
num_of_pclass1_alive = len(titanic[(titanic['pclass'] == 1) & 
                                   (titanic['survived'] == 1)])  # 1등급 객실 생존자 수
print('1등급 객실 생존 비율:', num_of_pclass1_alive / num_of_pclass1)

# 2등급 객실 승객 중 생존자 비율
num_of_pclass2 = len(titanic[titanic['pclass'] == 2])  # 2등급 객실 승객 수
num_of_pclass2_alive = len(titanic[(titanic['pclass'] == 2) & 
                                   (titanic['survived'] == 1)])  # 2등급 객실 생존자 수
print('2등급 객실 생존 비율:', num_of_pclass2_alive / num_of_pclass2)

# 3등급 객실 승객 중 생존자 비율
num_of_pclass3 = len(titanic[titanic['pclass'] == 3])  # 3등급 객실 승객 수
num_of_pclass3_alive = len(titanic[(titanic['pclass'] == 3) & 
                                   (titanic['survived'] == 1)])  # 3등급 객실 생존자 수
print('3등급 객실 생존 비율:', num_of_pclass3_alive / num_of_pclass3)

1등급 객실 생존 비율: 0.6296296296296297
2등급 객실 생존 비율: 0.47282608695652173
3등급 객실 생존 비율: 0.24236252545824846

In [58]:
# 각 객실 등급별 승객수
num_by_pclass = titanic['pclass'].value_counts()
num_by_pclass

3    491
1    216
2    184
Name: pclass, dtype: int64

In [59]:
# 각 객실 등급별 생존자 수 - 생존자 부분집합에서 객실별(pclass 컬럼의) value_counts
alive_by_pclass = titanic[titanic['survived'] == 1]['pclass'].value_counts()
alive_by_pclass

1    136
3    119
2     87
Name: pclass, dtype: int64

In [60]:
# 각 객실 등급에서 생존자 비율
for pclass in range(1, 4):
    print(f'{pclass}등급 객실 생존 비율: {alive_by_pclass.loc[pclass] / num_by_pclass.loc[pclass]}')

1등급 객실 생존 비율: 0.6296296296296297
2등급 객실 생존 비율: 0.47282608695652173
3등급 객실 생존 비율: 0.24236252545824846

In [64]:
# 10대 생존자 숫자, 비율
#   생존자들 중에서 10대의 숫자
alive_teen = len(titanic[(titanic['survived'] == 1) & 
                         (titanic['age'] >= 10) &
                         (titanic['age'] < 20)])
print(alive_teen)

#   10대 승객들(생존 or 사망) 중에서 생존자의 비율
# 10대 승객 수
teen = len(titanic[(titanic['age'] >= 10) & (titanic['age'] < 20)])
print(teen)

print('10대 생존율:', alive_teen / teen)

41
102
10대 생존율: 0.4019607843137255

In [67]:
# 10세 미만의 승객수
child = len(titanic[titanic['age'] < 10])
print(child)

# 10세 미만의 생존자 수
child_alive = len(titanic[(titanic['age'] < 10) & (titanic['survived'] == 1)])
print(child_alive)

# 비율
print('어린이 생존율:', child_alive / child)

62
38
어린이 생존율: 0.6129032258064516